espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/mipi_csi_host_eco5_struct.h
/** Type of int_force_phy_fatal register
 *  NA
 */
typedef union {
    struct {
        /** force_phy_errsotsynchs_0 : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t force_phy_errsotsynchs_0:1;
        /** force_phy_errsotsynchs_1 : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t force_phy_errsotsynchs_1:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} csi_host_int_force_phy_fatal_reg_t;

/** Type of int_st_pkt_fatal register
 *  NA
 */
typedef union {
    struct {
        /** st_err_ecc_double : RC; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t st_err_ecc_double:1;
        /** st_shorter_payload : RC; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t st_shorter_payload:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} csi_host_int_st_pkt_fatal_reg_t;

/** Type of int_msk_pkt_fatal register
 *  NA
 */
typedef union {
    struct {
        /** mask_err_ecc_double : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t mask_err_ecc_double:1;
        /** mask_shorter_payload : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t mask_shorter_payload:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} csi_host_int_msk_pkt_fatal_reg_t;

/** Type of int_force_pkt_fatal register
 *  NA
 */
typedef union {
    struct {
        /** force_err_ecc_double : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t force_err_ecc_double:1;
        /** force_shorter_payload : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t force_shorter_payload:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} csi_host_int_force_pkt_fatal_reg_t;

/** Type of int_st_phy register
 *  NA
 */
typedef union {
    struct {
        /** st_phy_errsoths_0 : RC; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t st_phy_errsoths_0:1;
        /** st_phy_errsoths_1 : RC; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t st_phy_errsoths_1:1;
        uint32_t reserved_2:14;
        /** st_phy_erresc_0 : RC; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t st_phy_erresc_0:1;
        /** st_phy_erresc_1 : RC; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t st_phy_erresc_1:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} csi_host_int_st_phy_reg_t;

/** Type of int_msk_phy register
 *  NA
 */
typedef union {
    struct {
        /** mask_phy_errsoths_0 : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t mask_phy_errsoths_0:1;
        /** mask_phy_errsoths_1 : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t mask_phy_errsoths_1:1;
        uint32_t reserved_2:14;
        /** mask_phy_erresc_0 : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t mask_phy_erresc_0:1;
        /** mask_phy_erresc_1 : R/W; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t mask_phy_erresc_1:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} csi_host_int_msk_phy_reg_t;

/** Type of int_force_phy register
 *  NA
 */
typedef union {
    struct {
        /** force_phy_errsoths_0 : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t force_phy_errsoths_0:1;
        /** force_phy_errsoths_1 : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t force_phy_errsoths_1:1;
        uint32_t reserved_2:14;
        /** force_phy_erresc_0 : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t force_phy_erresc_0:1;
        /** force_phy_erresc_1 : R/W; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t force_phy_erresc_1:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} csi_host_int_force_phy_reg_t;

/** Type of int_st_bndry_frame_fatal register
 *  NA
 */
typedef union {
    struct {
        /** st_err_f_bndry_match_vc0 : RC; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t st_err_f_bndry_match_vc0:1;
        /** st_err_f_bndry_match_vc1 : RC; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t st_err_f_bndry_match_vc1:1;
        /** st_err_f_bndry_match_vc2 : RC; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t st_err_f_bndry_match_vc2:1;
        /** st_err_f_bndry_match_vc3 : RC; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t st_err_f_bndry_match_vc3:1;
        /** st_err_f_bndry_match_vc4 : RC; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t st_err_f_bndry_match_vc4:1;
        /** st_err_f_bndry_match_vc5 : RC; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t st_err_f_bndry_match_vc5:1;
        /** st_err_f_bndry_match_vc6 : RC; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t st_err_f_bndry_match_vc6:1;
        /** st_err_f_bndry_match_vc7 : RC; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t st_err_f_bndry_match_vc7:1;
        /** st_err_f_bndry_match_vc8 : RC; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t st_err_f_bndry_match_vc8:1;
        /** st_err_f_bndry_match_vc9 : RC; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t st_err_f_bndry_match_vc9:1;
        /** st_err_f_bndry_match_vc10 : RC; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t st_err_f_bndry_match_vc10:1;
        /** st_err_f_bndry_match_vc11 : RC; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t st_err_f_bndry_match_vc11:1;
        /** st_err_f_bndry_match_vc12 : RC; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t st_err_f_bndry_match_vc12:1;
        /** st_err_f_bndry_match_vc13 : RC; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t st_err_f_bndry_match_vc13:1;
        /** st_err_f_bndry_match_vc14 : RC; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t st_err_f_bndry_match_vc14:1;
        /** st_err_f_bndry_match_vc15 : RC; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t st_err_f_bndry_match_vc15:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} csi_host_int_st_bndry_frame_fatal_reg_t;

/** Type of int_msk_bndry_frame_fatal register
 *  NA
 */
typedef union {
    struct {
        /** mask_err_f_bndry_match_vc0 : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_bndry_match_vc0:1;
        /** mask_err_f_bndry_match_vc1 : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_bndry_match_vc1:1;
        /** mask_err_f_bndry_match_vc2 : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_bndry_match_vc2:1;
        /** mask_err_f_bndry_match_vc3 : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_bndry_match_vc3:1;
        /** mask_err_f_bndry_match_vc4 : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_bndry_match_vc4:1;
        /** mask_err_f_bndry_match_vc5 : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_bndry_match_vc5:1;
        /** mask_err_f_bndry_match_vc6 : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_bndry_match_vc6:1;
        /** mask_err_f_bndry_match_vc7 : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_bndry_match_vc7:1;
        /** mask_err_f_bndry_match_vc8 : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_bndry_match_vc8:1;
        /** mask_err_f_bndry_match_vc9 : R/W; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_bndry_match_vc9:1;
        /** mask_err_f_bndry_match_vc10 : R/W; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_bndry_match_vc10:1;
        /** mask_err_f_bndry_match_vc11 : R/W; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_bndry_match_vc11:1;
        /** mask_err_f_bndry_match_vc12 : R/W; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_bndry_match_vc12:1;
        /** mask_err_f_bndry_match_vc13 : R/W; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_bndry_match_vc13:1;
        /** mask_err_f_bndry_match_vc14 : R/W; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_bndry_match_vc14:1;
        /** mask_err_f_bndry_match_vc15 : R/W; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_bndry_match_vc15:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} csi_host_int_msk_bndry_frame_fatal_reg_t;

