espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/mipi_csi_host_eco5_struct.h
/** Type of int_force_bndry_frame_fatal register
 *  NA
 */
typedef union {
    struct {
        /** force_err_f_bndry_match_vc0 : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t force_err_f_bndry_match_vc0:1;
        /** force_err_f_bndry_match_vc1 : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t force_err_f_bndry_match_vc1:1;
        /** force_err_f_bndry_match_vc2 : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t force_err_f_bndry_match_vc2:1;
        /** force_err_f_bndry_match_vc3 : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t force_err_f_bndry_match_vc3:1;
        /** force_err_f_bndry_match_vc4 : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t force_err_f_bndry_match_vc4:1;
        /** force_err_f_bndry_match_vc5 : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t force_err_f_bndry_match_vc5:1;
        /** force_err_f_bndry_match_vc6 : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t force_err_f_bndry_match_vc6:1;
        /** force_err_f_bndry_match_vc7 : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t force_err_f_bndry_match_vc7:1;
        /** force_err_f_bndry_match_vc8 : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t force_err_f_bndry_match_vc8:1;
        /** force_err_f_bndry_match_vc9 : R/W; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t force_err_f_bndry_match_vc9:1;
        /** force_err_f_bndry_match_vc10 : R/W; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t force_err_f_bndry_match_vc10:1;
        /** force_err_f_bndry_match_vc11 : R/W; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t force_err_f_bndry_match_vc11:1;
        /** force_err_f_bndry_match_vc12 : R/W; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t force_err_f_bndry_match_vc12:1;
        /** force_err_f_bndry_match_vc13 : R/W; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t force_err_f_bndry_match_vc13:1;
        /** force_err_f_bndry_match_vc14 : R/W; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t force_err_f_bndry_match_vc14:1;
        /** force_err_f_bndry_match_vc15 : R/W; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t force_err_f_bndry_match_vc15:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} csi_host_int_force_bndry_frame_fatal_reg_t;

/** Type of int_st_seq_frame_fatal register
 *  NA
 */
typedef union {
    struct {
        /** st_err_f_seq_vc0 : RC; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t st_err_f_seq_vc0:1;
        /** st_err_f_seq_vc1 : RC; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t st_err_f_seq_vc1:1;
        /** st_err_f_seq_vc2 : RC; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t st_err_f_seq_vc2:1;
        /** st_err_f_seq_vc3 : RC; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t st_err_f_seq_vc3:1;
        /** st_err_f_seq_vc4 : RC; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t st_err_f_seq_vc4:1;
        /** st_err_f_seq_vc5 : RC; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t st_err_f_seq_vc5:1;
        /** st_err_f_seq_vc6 : RC; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t st_err_f_seq_vc6:1;
        /** st_err_f_seq_vc7 : RC; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t st_err_f_seq_vc7:1;
        /** st_err_f_seq_vc8 : RC; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t st_err_f_seq_vc8:1;
        /** st_err_f_seq_vc9 : RC; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t st_err_f_seq_vc9:1;
        /** st_err_f_seq_vc10 : RC; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t st_err_f_seq_vc10:1;
        /** st_err_f_seq_vc11 : RC; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t st_err_f_seq_vc11:1;
        /** st_err_f_seq_vc12 : RC; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t st_err_f_seq_vc12:1;
        /** st_err_f_seq_vc13 : RC; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t st_err_f_seq_vc13:1;
        /** st_err_f_seq_vc14 : RC; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t st_err_f_seq_vc14:1;
        /** st_err_f_seq_vc15 : RC; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t st_err_f_seq_vc15:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} csi_host_int_st_seq_frame_fatal_reg_t;

/** Type of int_msk_seq_frame_fatal register
 *  NA
 */
typedef union {
    struct {
        /** mask_err_f_seq_vc0 : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_seq_vc0:1;
        /** mask_err_f_seq_vc1 : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_seq_vc1:1;
        /** mask_err_f_seq_vc2 : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_seq_vc2:1;
        /** mask_err_f_seq_vc3 : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_seq_vc3:1;
        /** mask_err_f_seq_vc4 : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_seq_vc4:1;
        /** mask_err_f_seq_vc5 : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_seq_vc5:1;
        /** mask_err_f_seq_vc6 : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_seq_vc6:1;
        /** mask_err_f_seq_vc7 : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_seq_vc7:1;
        /** mask_err_f_seq_vc8 : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_seq_vc8:1;
        /** mask_err_f_seq_vc9 : R/W; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_seq_vc9:1;
        /** mask_err_f_seq_vc10 : R/W; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_seq_vc10:1;
        /** mask_err_f_seq_vc11 : R/W; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_seq_vc11:1;
        /** mask_err_f_seq_vc12 : R/W; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_seq_vc12:1;
        /** mask_err_f_seq_vc13 : R/W; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_seq_vc13:1;
        /** mask_err_f_seq_vc14 : R/W; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_seq_vc14:1;
        /** mask_err_f_seq_vc15 : R/W; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t mask_err_f_seq_vc15:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} csi_host_int_msk_seq_frame_fatal_reg_t;

/** Type of int_force_seq_frame_fatal register
 *  NA
 */
typedef union {
    struct {
        /** force_err_f_seq_vc0 : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t force_err_f_seq_vc0:1;
        /** force_err_f_seq_vc1 : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t force_err_f_seq_vc1:1;
        /** force_err_f_seq_vc2 : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t force_err_f_seq_vc2:1;
        /** force_err_f_seq_vc3 : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t force_err_f_seq_vc3:1;
        /** force_err_f_seq_vc4 : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t force_err_f_seq_vc4:1;
        /** force_err_f_seq_vc5 : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t force_err_f_seq_vc5:1;
        /** force_err_f_seq_vc6 : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t force_err_f_seq_vc6:1;
        /** force_err_f_seq_vc7 : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t force_err_f_seq_vc7:1;
        /** force_err_f_seq_vc8 : R/W; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t force_err_f_seq_vc8:1;
        /** force_err_f_seq_vc9 : R/W; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t force_err_f_seq_vc9:1;
        /** force_err_f_seq_vc10 : R/W; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t force_err_f_seq_vc10:1;
        /** force_err_f_seq_vc11 : R/W; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t force_err_f_seq_vc11:1;
        /** force_err_f_seq_vc12 : R/W; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t force_err_f_seq_vc12:1;
        /** force_err_f_seq_vc13 : R/W; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t force_err_f_seq_vc13:1;
        /** force_err_f_seq_vc14 : R/W; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t force_err_f_seq_vc14:1;
        /** force_err_f_seq_vc15 : R/W; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t force_err_f_seq_vc15:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} csi_host_int_force_seq_frame_fatal_reg_t;

