espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/mipi_csi_host_eco5_struct.h
typedef struct {
    volatile csi_host_version_reg_t version;
    volatile csi_host_n_lanes_reg_t n_lanes;
    volatile csi_host_csi2_resetn_reg_t csi2_resetn;
    volatile csi_host_int_st_main_reg_t int_st_main;
    uint32_t reserved_010[12];
    volatile csi_host_phy_shutdownz_reg_t phy_shutdownz;
    volatile csi_host_dphy_rstz_reg_t dphy_rstz;
    volatile csi_host_phy_rx_reg_t phy_rx;
    volatile csi_host_phy_stopstate_reg_t phy_stopstate;
    volatile csi_host_phy_test_ctrl0_reg_t phy_test_ctrl0;
    volatile csi_host_phy_test_ctrl1_reg_t phy_test_ctrl1;
    uint32_t reserved_058[28];
    volatile csi_host_vc_extension_reg_t vc_extension;
    volatile csi_host_phy_cal_reg_t phy_cal;
    uint32_t reserved_0d0[4];
    volatile csi_host_int_st_phy_fatal_reg_t int_st_phy_fatal;
    volatile csi_host_int_msk_phy_fatal_reg_t int_msk_phy_fatal;
    volatile csi_host_int_force_phy_fatal_reg_t int_force_phy_fatal;
    uint32_t reserved_0ec;
    volatile csi_host_int_st_pkt_fatal_reg_t int_st_pkt_fatal;
    volatile csi_host_int_msk_pkt_fatal_reg_t int_msk_pkt_fatal;
    volatile csi_host_int_force_pkt_fatal_reg_t int_force_pkt_fatal;
    uint32_t reserved_0fc[5];
    volatile csi_host_int_st_phy_reg_t int_st_phy;
    volatile csi_host_int_msk_phy_reg_t int_msk_phy;
    volatile csi_host_int_force_phy_reg_t int_force_phy;
    uint32_t reserved_11c[89];
    volatile csi_host_int_st_bndry_frame_fatal_reg_t int_st_bndry_frame_fatal;
    volatile csi_host_int_msk_bndry_frame_fatal_reg_t int_msk_bndry_frame_fatal;
    volatile csi_host_int_force_bndry_frame_fatal_reg_t int_force_bndry_frame_fatal;
    uint32_t reserved_28c;
    volatile csi_host_int_st_seq_frame_fatal_reg_t int_st_seq_frame_fatal;
    volatile csi_host_int_msk_seq_frame_fatal_reg_t int_msk_seq_frame_fatal;
    volatile csi_host_int_force_seq_frame_fatal_reg_t int_force_seq_frame_fatal;
    uint32_t reserved_29c;
    volatile csi_host_int_st_crc_frame_fatal_reg_t int_st_crc_frame_fatal;
    volatile csi_host_int_msk_crc_frame_fatal_reg_t int_msk_crc_frame_fatal;
    volatile csi_host_int_force_crc_frame_fatal_reg_t int_force_crc_frame_fatal;
    uint32_t reserved_2ac;
    volatile csi_host_int_st_pld_crc_fatal_reg_t int_st_pld_crc_fatal;
    volatile csi_host_int_msk_pld_crc_fatal_reg_t int_msk_pld_crc_fatal;
    volatile csi_host_int_force_pld_crc_fatal_reg_t int_force_pld_crc_fatal;
    uint32_t reserved_2bc;
    volatile csi_host_int_st_data_id_reg_t int_st_data_id;
    volatile csi_host_int_msk_data_id_reg_t int_msk_data_id;
    volatile csi_host_int_force_data_id_reg_t int_force_data_id;
    uint32_t reserved_2cc;
    volatile csi_host_int_st_ecc_corrected_reg_t int_st_ecc_corrected;
    volatile csi_host_int_msk_ecc_corrected_reg_t int_msk_ecc_corrected;
    volatile csi_host_int_force_ecc_corrected_reg_t int_force_ecc_corrected;
    uint32_t reserved_2dc[9];
    volatile csi_host_scrambling_reg_t scrambling;
    volatile csi_host_scrambling_seed1_reg_t scrambling_seed1;
    volatile csi_host_scrambling_seed2_reg_t scrambling_seed2;
} csi_host_dev_t;

extern csi_host_dev_t MIPI_CSI_HOST;

#ifndef __cplusplus
_Static_assert(sizeof(csi_host_dev_t) == 0x30c, "Invalid size of csi_host_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
